#include "Ellipse.h"
#include <vector>
#include <cmath>


//-----------------------------------------------------------------------------
/**
  \ru Коструктор Ellipse. Вычисляются два радиуса и записывается центральная точка
*/
//-----------------------------------------------------------------------------
Ellipse::Ellipse( const std::vector<QPoint>& points )
{
  center = points[0];

  r1 = sqrt( (points[0].x() - points[1].x()) *(points[0].x() - points[1].x())
      + ( points[0].y() - points[1].y() ) *(points[0].y() - points[1].y()) );

  r2 = sqrt( (points[0].x() - points[2].x()) *(points[0].x() - points[2].x())
      + ( points[0].y() - points[2].y() ) *(points[0].y() - points[2].y()) );
}


//-----------------------------------------------------------------------------
/**
  \ru возвращается точка по параметру t
*/
//-----------------------------------------------------------------------------
QPointF Ellipse::GetPoint( double t )
{
  return QPointF ( center.x() + r1 * sin(t), center.y() + r2 * cos(t) );
}


//-----------------------------------------------------------------------------
/**
  \ru возращаются границы параметра t для эллипса
*/
//-----------------------------------------------------------------------------
QPointF Ellipse::GetRange()
{
  return QPointF ( 0.0, 2.0 * 3.14 );
}
