#include "GeometricPoint.h"

//-----------------------------------------------------------------------------
/**
  \ru Коструктор GeometricPoint
*/
//-----------------------------------------------------------------------------
GeometricPoint::GeometricPoint( Point point ):
  point( point )
{
}

//-----------------------------------------------------------------------------
/**
  \ru возращаются границы параметра t для точки. считаем что они нулевые: [0, 0]
*/
//-----------------------------------------------------------------------------
Range GeometricPoint::GetRange() const
{
  return Range( 0.0, 0.0 );
}


//-----------------------------------------------------------------------------
/**
  \ru возвращается точка по параметру t
*/
//-----------------------------------------------------------------------------
Point GeometricPoint::GetPoint( double t ) const
{
  (void)t;
  return point;
}



//-----------------------------------------------------------------------------
/**
  \ru возвращается точка по параметру t
*/
//-----------------------------------------------------------------------------
Point GeometricPoint::GetDerivativePoint( double t ) const
{
  (void)t;
  return point;
}


//-----------------------------------------------------------------------------
/**
  \ru возвращается точка по параметру t
*/
//-----------------------------------------------------------------------------
Point GeometricPoint::Get2DerivativePoint( double t ) const
{
  (void)t;
  return point;

}


//-----------------------------------------------------------------------------
/**
  \ru позвращается полилилния для текущей точки
*/
//-----------------------------------------------------------------------------
void GeometricPoint::GetAsPolyLine( std::vector<Point> & polyLinePoints, double accuracy ) const
{
  polyLinePoints.push_back( point );
}
