#include "GeometricPoint.h"

//-----------------------------------------------------------------------------
/**
  \ru Коструктор GeometricPoint
*/
//-----------------------------------------------------------------------------
GeometricPoint::GeometricPoint( Point point ):
  point( point )
{}

//-----------------------------------------------------------------------------
/**
  \ru возращаются границы параметра t для точки. считаем что они нулевые: [0, 0]
*/
//-----------------------------------------------------------------------------
Range GeometricPoint::GetRange() const
{
  return Range( 0.0, 0.0 );
}


//-----------------------------------------------------------------------------
/**
  \ru возвращается точка по параметру t
*/
//-----------------------------------------------------------------------------
Point GeometricPoint::GetPoint( double t ) const
{
  (void)t;
  return point;
}
