#include "Line.h"


//-----------------------------------------------------------------------------
/**
  \ru Коструктор Line Записывается начальная точка и вектор направления
*/
//-----------------------------------------------------------------------------
Line::Line( const std::vector<QPoint>& points )
{
  startPoint = points[0];
  direction = QPointF( points[0].x() - points[1].x(),points[0].y() - points[1].y() );
}

//-----------------------------------------------------------------------------
/**
  \ru возращаются границы параметра t для прямой
*/
//-----------------------------------------------------------------------------
QPointF Line::GetRange()
{
  return QPointF( 0.0,1.0 );
}

QPointF Line::GetPoint( double t )
{
  return QPoint( 0.0,0.0 );
}
