#include "Point.h"


//-----------------------------------------------------------------------------
/**
  Коструктор Point
*/
//-----------------------------------------------------------------------------
Point::Point( QPointF point ):
  point( point ){}


//-----------------------------------------------------------------------------
/**
  возвращается точка по параметру t (это бессмысленное действие, но сделано для общности)
*/
//-----------------------------------------------------------------------------
QPointF Point::GetPoint( double t )
{
  return point;
}


//-----------------------------------------------------------------------------
/**
  возращаются границы параметра t для точки (они считаются нулевыми)
*/
//-----------------------------------------------------------------------------
QPointF Point::GetRange()
{
  return QPointF( 0.0,0.0 );

}
