////////////////////////////////////////////////////////////////////////////////
/**
  \file
  \brief \ru интрервал с включенными границами\~

*/
////////////////////////////////////////////////////////////////////////////////

#ifndef RANGE_H
#define RANGE_H

//------------------------------------------------------------------------------
/** \brief \ru Класс представления интервала. Интевал преставляется двумя границами
 * : началом и концом. Считаем, что начало всегда меньше конца. \~
*/
// ---
class Range {
private:
  double start; ///< начало
  double end; ///< конец
public:
  Range() = default;
  /**  \brief \ru создать интервал по началу и концу интервала
    \param[in] start - начало интервала .\~
    \param[in] end - конец интервала .\~
  */
  //---
  Range( double start, double end );
  Range(const Range& range);
  virtual ~Range() = default;

public:
  double GetStart () const; ///< получить конец интервала
  double GetEnd   () const; ///< получить конец интервала
};

#endif // RANGE_H

