#include "CreatorHandler.h"


//-----------------------------------------------------------------------------
/**
  \ru добавление точки с экрана в массив точек
*/
//-----------------------------------------------------------------------------
void CreatorHandler::AddPointFromScreen( Point point )
{
  points.push_back( point );
}


//-----------------------------------------------------------------------------
/**
 \ru  возвращает количество точек, необходимое для отрисовки текущего геометрического примитива
*/
//-----------------------------------------------------------------------------
void CreatorHandler::AddSufficientNum ( int num )
{
  numExpectedPoits = num;
}


//-----------------------------------------------------------------------------
/**
   \ru проверка, достаточно точек на экране выбрано для построения кривой
*/
//-----------------------------------------------------------------------------
bool CreatorHandler::IsSufficientNum() const
{
  return ( points.size() == numExpectedPoits );
}


//-----------------------------------------------------------------------------
/**
   \ru создает кривую по точкам
*/
//-----------------------------------------------------------------------------
std::shared_ptr<GeometricPrimitive> CreatorHandler::Create()
{
 return creator->Create( points );
}


//-----------------------------------------------------------------------------
/**
   \ru возвратить опорные точки
*/
//-----------------------------------------------------------------------------
const std::vector<Point>& CreatorHandler::RefPoints() const
{
  return points;
}


//-----------------------------------------------------------------------------
/**
   \ru очистить массив точек, полученных с экрана
*/
//-----------------------------------------------------------------------------
void CreatorHandler::ClearPoints()
{
  points.clear();
}
